In [1]:
import pandas as pd

In [2]:
date_list = [
    {'date' : '2000-06-27'},
    {'date' : '2002-09-24'},
    {'date' : '2005-12-20'},
]

In [3]:
pd.DataFrame(date_list, columns = ['date'])

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [4]:
df = pd.DataFrame(date_list, columns = ['date'])

## *.map()

>하나의 column 을 변경 하고 싶은 경우
---

In [5]:
def extract_year(date):
    return date.split('-')[0]

In [6]:
df['year'] = df['date'].map(extract_year)

In [7]:
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [10]:
job_list = [
    {'age' : 20, 'job' : 'student'},
    {'age' : 30, 'job' : 'developer'},
    {'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(job_list)
df

   age        job
0   15    student
1   25  developer
2   30    teacher

In [11]:
df.job = df.job.map({'student':1, 'developer': 2, 'teacher': 3})

In [12]:
df

   age  job
0   15    1
1   25    2
2   30    3

In [13]:
x_y = [{'x' : 5.5, 'y' : -5.6, 'z' : -1.1},
       {'x' : -5.2, 'y' : 5.5, 'z' : -2.2},
       {'x' : -1.6, 'y' : -4.5, 'z' : -3.3},]
df = pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [14]:
import numpy as np

## *.applymap()

>모든 column 에 적용하고 싶은 경우
---

In [15]:
df = df.applymap(np.around)
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0